{
    "rules": {
        "voltage_level": {
            "conditions": [
                {
                    "parameter": "voltage",
                    "threshold_low": 1000,
                    "threshold_high": 36000,
                    "recommendation_below": "For voltages below 1 kV, a low-voltage distribution transformer is suitable.",
                    "recommendation_between": "For voltages between 1 kV and 36 kV, a medium-voltage power transformer is recommended.",
                    "recommendation_above": "For voltages above 36 kV, a high-voltage transformer is required."
                }
            ],
            "default_recommendation": "Please contact us for more information about the suitable voltage level."
        },
        "power_capacity": {
            "conditions": [
                {
                    "parameter": "power",
                    "threshold_low": 500,
                    "threshold_high": 5000,
                    "recommendation_below": "For capacities below 500 kVA, a compact distribution transformer is sufficient.",
                    "recommendation_between": "For capacities between 500 kVA and 5 MVA, a standard power transformer is recommended.",
                    "recommendation_above": "For capacities above 5 MVA, a high-capacity transformer is required."
                }
            ],
            "default_recommendation": "Please provide the required capacity to receive a precise recommendation."
        },
        "installation_environment": {
            "conditions": [
                {
                    "parameter": "environment",
                    "values": ["indoor", "outdoor"],
                    "recommendation": {
                        "indoor": "For indoor use, a cast resin transformer is recommended due to its safety and noise reduction.",
                        "outdoor": "For outdoor use, an oil-filled transformer is suitable as it is more resistant to environmental factors."
                    }
                }
            ],
            "default_recommendation": "Please specify the installation environment (indoor or outdoor)."
        },
        "environmental_conditions": {
            "conditions": [
                {
                    "parameter": "conditions",
                    "values": ["humid", "dusty", "hot"],
                    "recommendation": {
                        "humid": "For humid environments, cast resin transformers are recommended due to their better protection against moisture.",
                        "dusty": "For dusty environments, cast resin transformers are particularly suitable.",
                        "hot": "For high temperatures, transformers with advanced cooling or heat-resistant materials are required."
                    }
                }
            ],
            "default_recommendation": "Please specify the specific environmental conditions."
        },
        "application_type": {
            "conditions": [
                {
                    "parameter": "application",
                    "values": ["renewable", "industrial", "utility"],
                    "recommendation": {
                        "renewable": "For renewable energy applications such as solar or wind power, specialized transformers with appropriate winding and voltage are recommended.",
                        "industrial": "For industrial applications, robust transformers with high surge resistance are suitable.",
                        "utility": "For grid integration, transformers with tailored voltages and frequencies are recommended."
                    }
                }
            ],
            "default_recommendation": "Please specify the application type to receive the correct recommendation."
        },
        "cooling_method": {
            "conditions": [
                {
                    "parameter": "cooling",
                    "values": ["dry", "oil"],
                    "recommendation": {
                        "dry": "Dry-type transformers are suitable for indoor installations with good ventilation.",
                        "oil": "Oil-immersed transformers offer better cooling and are suitable for higher capacities."
                    }
                }
            ],
            "default_recommendation": "Please specify the desired cooling method."
        },
        "construction_type": {
            "conditions": [
                {
                    "parameter": "construction",
                    "values": ["core", "shell"],
                    "recommendation": {
                        "core": "Core-type transformers are suitable for high voltages and capacities.",
                        "shell": "Shell-type transformers provide better mechanical stability and are suitable for specific applications."
                    }
                }
            ],
            "default_recommendation": "Please specify the preferred construction type."
        },
        "vector_group": {
            "conditions": [
                {
                    "parameter": "vector_group",
                    "values": ["Dyn", "Yyn"],
                    "recommendation": {
                        "Dyn": "The Delta-Star (Dyn) vector group is commonly used in distribution networks.",
                        "Yyn": "The Star-Star (Yyn) vector group is suitable for specific applications with symmetrical loads."
                    }
                }
            ],
            "default_recommendation": "Please specify the desired vector group."
        }
    }
}
