{
    "rules": {
        "voltage_level": {
            "conditions": [
                {
                    "parameter": "voltage",
                    "threshold_low": 1000,
                    "threshold_high": 36000,
                    "recommendation_below": "Für Spannungen unter 1 kV ist ein Niederspannungs-Verteiltransformator geeignet.",
                    "recommendation_between": "Für Spannungen zwischen 1 kV und 36 kV wird ein Mittelspannungs-Leistungstransformator empfohlen.",
                    "recommendation_above": "Für Spannungen über 36 kV ist ein Hochspannungstransformator erforderlich."
                }
            ],
            "default_recommendation": "Bitte kontaktieren Sie uns für weitere Informationen zur geeigneten Spannungsebene."
        },
        "power_capacity": {
            "conditions": [
                {
                    "parameter": "power",
                    "threshold_low": 500,
                    "threshold_high": 5000,
                    "recommendation_below": "Für Leistungen unter 500 kVA eignet sich ein kompakter Verteiltransformator.",
                    "recommendation_between": "Für Leistungen zwischen 500 kVA und 5 MVA wird ein Standard-Leistungstransformator empfohlen.",
                    "recommendation_above": "Für Leistungen über 5 MVA ist ein Hochleistungstransformator erforderlich."
                }
            ],
            "default_recommendation": "Bitte geben Sie die gewünschte Leistungskapazität an, um eine präzise Empfehlung zu erhalten."
        },
        "installation_environment": {
            "conditions": [
                {
                    "parameter": "environment",
                    "values": ["indoor", "outdoor"],
                    "recommendation": {
                        "indoor": "Für den Innenbereich wird ein Gießharztransformator aufgrund seiner Sicherheit und Geräuschreduzierung empfohlen.",
                        "outdoor": "Für den Außenbereich eignet sich ein ölgekühlter Transformator, da er widerstandsfähiger gegenüber Umwelteinflüssen ist."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie den Einsatzort (Innen- oder Außenbereich) an."
        },
        "environmental_conditions": {
            "conditions": [
                {
                    "parameter": "conditions",
                    "values": ["humid", "dusty", "hot"],
                    "recommendation": {
                        "humid": "Für feuchte Umgebungen empfehlen wir Gießharztransformatoren, da sie besser vor Feuchtigkeit geschützt sind.",
                        "dusty": "In staubigen Umgebungen sind Gießharztransformatoren besonders geeignet.",
                        "hot": "Für hohe Temperaturen sollten Transformatoren mit spezieller Kühlung oder hitzebeständigen Materialien verwendet werden."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie die spezifischen Umgebungsbedingungen an."
        },
        "application_type": {
            "conditions": [
                {
                    "parameter": "application",
                    "values": ["renewable", "industrial", "utility"],
                    "recommendation": {
                        "renewable": "Für erneuerbare Energien wie Solar- oder Windkraftanlagen empfehlen wir spezialisierte Transformatoren mit passender Wicklung und Spannung.",
                        "industrial": "Für industrielle Anwendungen eignen sich robuste Transformatoren mit hoher Stoßstromfestigkeit.",
                        "utility": "Für Netzeinspeisung sind Transformatoren mit abgestimmten Spannungen und Frequenzen geeignet."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie den Anwendungsbereich an, um die richtige Empfehlung zu erhalten."
        },
        "cooling_method": {
            "conditions": [
                {
                    "parameter": "cooling",
                    "values": ["dry", "oil"],
                    "recommendation": {
                        "dry": "Luftgekühlte Transformatoren sind für Innenräume mit guter Belüftung geeignet.",
                        "oil": "Ölgefüllte Transformatoren bieten eine bessere Kühlung und sind für höhere Leistungen geeignet."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie die gewünschte Kühlmethode an."
        },
        "construction_type": {
            "conditions": [
                {
                    "parameter": "construction",
                    "values": ["core", "shell"],
                    "recommendation": {
                        "core": "Transformatoren in Kernbauweise sind für hohe Spannungen und Leistungen geeignet.",
                        "shell": "Transformatoren in Mantelbauweise bieten mehr mechanische Stabilität und eignen sich für spezielle Anwendungen."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie die bevorzugte Bauweise an."
        },
        "vector_group": {
            "conditions": [
                {
                    "parameter": "vector_group",
                    "values": ["Dyn", "Yyn"],
                    "recommendation": {
                        "Dyn": "Die Schaltgruppe Dreieck-Stern (Dyn) wird häufig in Verteilnetzen verwendet.",
                        "Yyn": "Die Schaltgruppe Stern-Stern (Yyn) eignet sich für spezielle Anwendungen mit symmetrischer Last."
                    }
                }
            ],
            "default_recommendation": "Bitte geben Sie die gewünschte Schaltgruppe an."
        }
    }
}
