[
    {
        "condition": "Wenn der Kunde einen Transformator kaufen möchte",
        "recommendation": "Weisen Sie darauf hin, dass der Kunde das Kontaktformular auf der Seite https://www.pfalztrafo.de/kontakt ausfüllen oder anrufen kann."
    },
    {
        "condition": "Wenn der Kunde nach der Lebensdauer eines Transformators fragt",
        "recommendation": "Informieren Sie den Kunden, dass die Lebensdauer eines Transformators bei guter Wartung zwischen 20 und 30 Jahren liegen kann."
    },
    {
        "condition": "Wenn der Kunde nach Wartungsdiensten fragt",
        "recommendation": "Empfehlen Sie den Wartungsdienst von Pfalztrafo, der Inspektion, Reinigung und den Austausch von Verschleißteilen umfasst."
    },
    {
        "condition": "Wenn der Kunde nach der Funktionsweise eines Transformators fragt",
        "recommendation": "Erklären Sie, dass Transformatoren durch elektromagnetische Induktion arbeiten, um elektrische Spannung zu erhöhen oder zu verringern."
    },
    {
        "condition": "Wenn der Kunde nach verschiedenen Transformator-Typen fragt",
        "recommendation": "Informieren Sie über verschiedene Typen wie Leistungstransformatoren, Verteiltransformatoren und Spezialtransformatoren."
    },
    {
        "condition": "Wenn der Kunde nach Gießharz- oder Öltransformatoren fragt",
        "recommendation": "Erklären Sie, dass Gießharztransformatoren für Innenräume geeignet sind, während Öltransformatoren häufig im Freien eingesetzt werden."
    },
    {
        "condition": "Wenn der Kunde nach der Notwendigkeit von Ölproben fragt",
        "recommendation": "Weisen Sie darauf hin, dass regelmäßige Ölproben die Qualität und Lebensdauer des Transformators überwachen."
    },
    {
        "condition": "Wenn der Kunde nach Abdichtungsdiensten fragt",
        "recommendation": "Informieren Sie über Abdichtungsdienste für Hochspannungs- und Niederspannungsdurchführungen, Schaugläser und andere Komponenten."
    },
    {
        "condition": "Wenn der Kunde nach der Nachrüstung von Schutzsystemen fragt",
        "recommendation": "Empfehlen Sie die Nachrüstung von Buchholzschutzrelais, Hermetikschutzblöcken und Temperaturüberwachungen."
    },
    {
        "condition": "Wenn der Kunde nach der Umrüstung auf berührungssichere Durchführungen fragt",
        "recommendation": "Informieren Sie über die Umrüstung auf berührungssichere Mittelspannungs-Steckdurchführungen und Niederspannungs-Abdeckhauben."
    }
]
